{
  "nav.title": "Essential Questions Before Marriage",
  "nav.ice.breakers": "Ice Breakers",
  "nav.entertainment": "Entertainment",
  "ice.breakers.1.question": "Someone walks into the room and you smile from ear to ear; who is that person?",
  "ice.breakers.1.answer": "I guess that person could be a close friend I haven’t seen in forever, like someone I used to hang out with all the time, and just seeing them again would make me so happy.",
  "ice.breakers.2.question": "What is the last good laugh you had?",
  "ice.breakers.2.answer": "The last good laugh I had was when I watched this hilarious video of a cat trying to jump onto a table but missing completely. I couldn’t stop laughing for a good five minutes.",
  "ice.breakers.3.question": "Have you ever had any pets?",
  "ice.breakers.3.answer": "Yes, I’ve had pets before. I used to have a cat when I was a kid, and later I had a couple of birds. They were all amazing in their own way.",
  "ice.breakers.4.question": "Who was your favorite teacher and why?",
  "ice.breakers.4.answer": "My favorite teacher was my history teacher in high school. He made learning so fun with his storytelling, and he really cared about his students. I’ll never forget how passionate he was about the subject.",
  "ice.breakers.5.question": "Who is one of your best friends? What do you like about them?",
  "ice.breakers.5.answer": "One of my best friends is Alex. I like how he’s always there for me no matter what, and he’s got this chill vibe that makes everything feel less stressful.",
  "ice.breakers.6.question": "What is your first/oldest memory?",
  "ice.breakers.6.answer": "My oldest memory is when I was around three years old, sitting in the backyard with my mom, eating watermelon on a sunny afternoon. It’s such a simple but happy memory.",
  "ice.breakers.7.question": "Which would you choose - dishes or laundry?",
  "ice.breakers.7.answer": "I’d choose dishes because it’s faster and less tedious than doing laundry. Plus, there’s something satisfying about seeing clean dishes right away.",
  "ice.breakers.8.question": "If you were a superhero, what would your power be?",
  "ice.breakers.8.answer": "If I were a superhero, my power would be teleportation. It’d be awesome to go anywhere in the world instantly, no more traffic or long flights.",
  "ice.breakers.9.question": "What are your main hobbies?",
  "ice.breakers.9.answer": "My main hobbies are reading, playing video games, and cooking. They help me relax and keep things interesting.",
  "ice.breakers.10.question": "What is one awesome thing about your job/career/major and what is one difficult thing about it?",
  "ice.breakers.10.answer": "One awesome thing about being a software engineer is that I get to solve complex problems and build stuff that people actually use. But in the middle of this tech winter, the difficult part is the uncertainty—layoffs and job stability are always on my mind.",
  "ice.breakers.11.question": "Your thoughts on social media. Mention some pros and cons",
  "ice.breakers.11.answer": "Social media is a great way to stay connected and discover new things, but it can also be overwhelming. The pros are networking opportunities, sharing creativity, and keeping up with friends. The cons are the pressure to compare yourself to others and the addictive nature of constantly scrolling.",
  "ice.breakers.12.question": "What's the best thing about being you?",
  "ice.breakers.12.answer": "The best thing about being me is my ability to adapt quickly. No matter the situation, I can figure things out and keep moving forward, which helps me stay calm and focused.",
  "ice.breakers.13.question": "What has been a defining moment in your life?",
  "ice.breakers.13.answer": "A defining moment in my life was when I decided to change careers and become a software engineer. It was a big risk, but it turned out to be the right decision, and it completely changed my perspective on life.",
  "ice.breakers.14.question": "Would you rather be rich and miserable or poor and happy?",
  "ice.breakers.14.answer": " I guess I’d choose to be rich and miserable, but not without some caveats. While money can’t buy happiness, at least if I’m miserable, I could afford things that help me cope, like travel, good therapy, or just having the means to work on changing my situation.",
  "ice.breakers.15.question": "What are your educational goals?",
  "ice.breakers.15.answer": "My educational goal is to continuously learn and improve my skills, especially in tech. I want to keep up with the latest advancements, like AI and machine learning, so I can apply them to real-world problems and stay competitive in my field.",
  "ice.breakers.16.question": "What are your career aspirations?",
  "ice.breakers.16.answer": "My career aspiration is to become an expert in software development, specializing in building scalable and impactful systems. I also want to eventually lead a team of developers and help shape innovative projects that make a real difference.",
  "ice.breakers.17.question": "What makes you most joyful? What do you do when you are joyful?",
  "ice.breakers.17.answer": "What makes me most joyful is spending time with the people I care about, whether it’s hanging out, laughing, or just talking. When I’m joyful, I usually do something relaxing, like watching a favorite show or playing video games to keep that good vibe going.",
  "ice.breakers.18.question": "What makes you most insecure? How do you handle your insecurities?",
  "ice.breakers.18.answer": "What makes me most insecure is comparing myself to others, especially in terms of success or achievements. To handle it, I try to focus on my own progress, remind myself that everyone’s journey is different, and avoid getting caught up in other people’s timelines.",
  "ice.breakers.19.question": "What is your greatest limitation?",
  "ice.breakers.19.answer": "My greatest limitation is probably my tendency to overthink things. It sometimes holds me back from making quick decisions or taking action. I try to manage it by reminding myself to trust my instincts more and not dwell too long on the details.",
  "ice.breakers.20.question": "What is your greatest strength?",
  "ice.breakers.20.answer": "My greatest strength would be my ability to communicate openly. I believe in talking things through and making sure both sides are heard, which helps avoid misunderstandings and build trust.",
  "ice.breakers.21.question": "Where would you like to be in life 1 year from now? 5 years from now? 10 years from now?",
  "ice.breakers.21.answer": "A year from now, I hope my relationship with my partner is stronger, and we’re building a more solid foundation for our future together. Career-wise, I’d like to be more established in what I’m doing and feel more secure financially.\nIn 5 years, I’d want us to be in a place where we’re both happy with where we are in life, maybe with a kid or two, and in a better financial position. In 10 years, I imagine a solid marriage, a stable career, and a balanced life with my partner, while being financially comfortable enough to pursue our dreams."
}
