{
  "nav.title": "Essential Questions Before Marriage",
  "nav.category": "Category",
  "nav.ice.breakers": "Ice Breakers",
  "nav.entertainment": "Entertainment",
  "nav.work.life": "Work Life",
  "nav.religion": "Religion",
  "nav.communication": "Communication",
  "ice.breakers.1.question": "Someone walks into the room and you smile from ear to ear; who is that person?",
  "ice.breakers.1.answer": "I guess that person could be a close friend I haven’t seen in forever, like someone I used to hang out with all the time, and just seeing them again would make me so happy.",
  "ice.breakers.2.question": "What is the last good laugh you had?",
  "ice.breakers.2.answer": "The last good laugh I had was when I watched this hilarious video of a cat trying to jump onto a table but missing completely. I couldn’t stop laughing for a good five minutes.",
  "ice.breakers.3.question": "Have you ever had any pets?",
  "ice.breakers.3.answer": "Yes, I’ve had pets before. I used to have a cat when I was a kid, and later I had a couple of birds. They were all amazing in their own way.",
  "ice.breakers.4.question": "Who was your favorite teacher and why?",
  "ice.breakers.4.answer": "My favorite teacher was my history teacher in high school. He made learning so fun with his storytelling, and he really cared about his students. I’ll never forget how passionate he was about the subject.",
  "ice.breakers.5.question": "Who is one of your best friends? What do you like about them?",
  "ice.breakers.5.answer": "One of my best friends is Alex. I like how he’s always there for me no matter what, and he’s got this chill vibe that makes everything feel less stressful.",
  "ice.breakers.6.question": "What is your first/oldest memory?",
  "ice.breakers.6.answer": "My oldest memory is when I was around three years old, sitting in the backyard with my mom, eating watermelon on a sunny afternoon. It’s such a simple but happy memory.",
  "ice.breakers.7.question": "Which would you choose - dishes or laundry?",
  "ice.breakers.7.answer": "I’d choose dishes because it’s faster and less tedious than doing laundry. Plus, there’s something satisfying about seeing clean dishes right away.",
  "ice.breakers.8.question": "If you were a superhero, what would your power be?",
  "ice.breakers.8.answer": "If I were a superhero, my power would be teleportation. It’d be awesome to go anywhere in the world instantly, no more traffic or long flights.",
  "ice.breakers.9.question": "What are your main hobbies?",
  "ice.breakers.9.answer": "My main hobbies are reading, playing video games, and cooking. They help me relax and keep things interesting.",
  "ice.breakers.10.question": "What is one awesome thing about your job/career/major and what is one difficult thing about it?",
  "ice.breakers.10.answer": "One awesome thing about being a software engineer is that I get to solve complex problems and build stuff that people actually use. But in the middle of this tech winter, the difficult part is the uncertainty—layoffs and job stability are always on my mind.",
  "ice.breakers.11.question": "Your thoughts on social media. Mention some pros and cons",
  "ice.breakers.11.answer": "Social media is a great way to stay connected and discover new things, but it can also be overwhelming. The pros are networking opportunities, sharing creativity, and keeping up with friends. The cons are the pressure to compare yourself to others and the addictive nature of constantly scrolling.",
  "ice.breakers.12.question": "What's the best thing about being you?",
  "ice.breakers.12.answer": "The best thing about being me is my ability to adapt quickly. No matter the situation, I can figure things out and keep moving forward, which helps me stay calm and focused.",
  "ice.breakers.13.question": "What has been a defining moment in your life?",
  "ice.breakers.13.answer": "A defining moment in my life was when I decided to change careers and become a software engineer. It was a big risk, but it turned out to be the right decision, and it completely changed my perspective on life.",
  "ice.breakers.14.question": "Would you rather be rich and miserable or poor and happy?",
  "ice.breakers.14.answer": " I guess I’d choose to be rich and miserable, but not without some caveats. While money can’t buy happiness, at least if I’m miserable, I could afford things that help me cope, like travel, good therapy, or just having the means to work on changing my situation.",
  "ice.breakers.15.question": "What are your educational goals?",
  "ice.breakers.15.answer": "My educational goal is to continuously learn and improve my skills, especially in tech. I want to keep up with the latest advancements, like AI and machine learning, so I can apply them to real-world problems and stay competitive in my field.",
  "ice.breakers.16.question": "What are your career aspirations?",
  "ice.breakers.16.answer": "My career aspiration is to become an expert in software development, specializing in building scalable and impactful systems. I also want to eventually lead a team of developers and help shape innovative projects that make a real difference.",
  "ice.breakers.17.question": "What makes you most joyful? What do you do when you are joyful?",
  "ice.breakers.17.answer": "What makes me most joyful is spending time with the people I care about, whether it’s hanging out, laughing, or just talking. When I’m joyful, I usually do something relaxing, like watching a favorite show or playing video games to keep that good vibe going.",
  "ice.breakers.18.question": "What makes you most insecure? How do you handle your insecurities?",
  "ice.breakers.18.answer": "What makes me most insecure is comparing myself to others, especially in terms of success or achievements. To handle it, I try to focus on my own progress, remind myself that everyone’s journey is different, and avoid getting caught up in other people’s timelines.",
  "ice.breakers.19.question": "What is your greatest limitation?",
  "ice.breakers.19.answer": "My greatest limitation is probably my tendency to overthink things. It sometimes holds me back from making quick decisions or taking action. I try to manage it by reminding myself to trust my instincts more and not dwell too long on the details.",
  "ice.breakers.20.question": "What is your greatest strength?",
  "ice.breakers.20.answer": "My greatest strength would be my ability to communicate openly. I believe in talking things through and making sure both sides are heard, which helps avoid misunderstandings and build trust.",
  "ice.breakers.21.question": "Where would you like to be in life 1 year from now? 5 years from now? 10 years from now?",
  "ice.breakers.21.answer": "A year from now, I hope my relationship with my partner is stronger, and we’re building a more solid foundation for our future together. Career-wise, I’d like to be more established in what I’m doing and feel more secure financially.\nIn 5 years, I’d want us to be in a place where we’re both happy with where we are in life, maybe with a kid or two, and in a better financial position. In 10 years, I imagine a solid marriage, a stable career, and a balanced life with my partner, while being financially comfortable enough to pursue our dreams.",
  "entertainment.1.question": "What would be the perfect weekday evening to you?",
  "entertainment.1.answer": "The perfect weekday evening for me would be a chill one, spent at home with my partner. We’d cook dinner together, watch a movie or series, and just unwind. No stress, just quality time to relax and connect.",
  "entertainment.2.question": "What do you like to do on the weekends?",
  "entertainment.2.answer": "On weekends, I like to spend time with my partner, whether it’s doing something fun like going out or just staying in and relaxing. We usually cook together, maybe hit up a café, or just enjoy a quiet day at home. It’s about recharging and having a good time together.",
  "entertainment.3.question": "What are your top 3 hobbies/leisure activities?",
  "entertainment.3.answer": "My top 3 hobbies would be cooking, playing video games, and watching movies or series. Cooking lets me get creative, video games are a fun escape, and watching movies is just a perfect way to unwind.",
  "entertainment.4.question": "What is an activity you have wanted to do, but did not get the chance to do it yet?",
  "entertainment.4.answer": "One activity I’ve wanted to do is travel to Japan. I’ve always been fascinated by the culture, food, and history there, but I just haven’t had the chance to go yet. It’s definitely on my bucket list.",
  "entertainment.5.question": "What are some hobbies you want to pursue with your future spouse?",
  "entertainment.5.answer": "Some hobbies I’d like to pursue with my future spouse would be cooking together, traveling to new places, and maybe even starting a little DIY project at home. It’d be fun to learn new things together and create memories while doing it.",
  "entertainment.6.question": "How important is spending time with friends to you?",
  "entertainment.6.answer": "Spending time with friends is really important to me. It helps me relax, recharge, and reminds me that life isn’t all about work. Quality time with friends keeps me grounded and helps maintain a good balance in life.",
  "entertainment.7.question": "How important is spending time alone to you?",
  "entertainment.7.answer": "Spending time alone is really important to me too. It gives me the space to reflect, recharge, and focus on my own growth. Having that time to myself helps me maintain a healthy balance between my relationships and personal well-being.",
  "entertainment.8.question": "Do you enjoy traveling?",
  "entertainment.8.answer": "Yes, I really enjoy traveling. It’s a great way to explore new places, experience different cultures, and make lasting memories. Whether it’s a short trip or a long vacation, I love discovering new spots and having adventures.",
  "entertainment.9.question": "What was your favorite trip? And why was it so memorable?",
  "entertainment.9.answer": "My favorite trip was when I went on Umrah with my mom. It was such a spiritual and emotional experience, and sharing it with her made it even more special. The whole trip felt peaceful, and it brought us closer. It’s a memory I’ll always cherish.",
  "entertainment.10.question": "What is your ideal local day/weekend trip?",
  "entertainment.10.answer": "My ideal local day trip would be a visit to a quiet beach or a nearby nature spot, somewhere I can just unwind and enjoy the natural beauty. I’d probably go with a small group of friends or my partner, have some good food, and just relax for the day.",
  "entertainment.11.question": "How often would you like to travel?",
  "entertainment.11.answer": "I’d like to travel a few times a year, maybe once every few months. It’s nice to have regular getaways to recharge and experience new things, but I also enjoy having time at home to balance it out.",
  "entertainment.12.question": "Where would you like to travel?",
  "entertainment.12.answer": "I’d love to travel to Japan, especially to explore its culture, food, and history. I’ve always been fascinated by the country. I’d also like to visit European countries like Italy and Spain for the sights, food, and the overall vibe.",
  "entertainment.13.question": "How would you feel about me going on a trip with my friends for a couple of days?",
  "entertainment.13.answer": " I wouldn’t mind at all if my partner went on a trip with their friends. I think it’s healthy to have some time with friends. But I’d feel a bit uneasy if all the friends were of the opposite gender. I’d just prefer a bit more balance in the group, you know?",
  "entertainment.14.question": "What would we do if we both had a break from work, but each of us had different ideas on how to spend it?",
  "entertainment.14.answer": "If we both had a break but had different ideas on how to spend it, I’d suggest we find a middle ground. Maybe we could do something you want first, then something I’d like to do. It’s all about compromising and making sure we both have a good time, even if the activities are different.",
  "work.life.1.question": "What was the first job you had?",
  "work.life.1.answer": "The first job I had was working at a café as a barista. It was a pretty cool experience because I got to learn how to make coffee, interact with customers, and handle the rush during busy hours. It taught me a lot about patience and multitasking.",
  "work.life.2.question": "Where have you volunteered before?",
  "work.life.2.answer": "I’ve volunteered at a local community center, helping organize events and activities for kids. It was a rewarding experience because I got to make a positive impact on the community and spend time with the younger generation.",
  "work.life.3.question": "What has your favorite job/volunteer experience been?",
  "work.life.3.answer": "My favorite job experience was when I worked as a cashier at Indomaret. It might sound simple, but I enjoyed the fast-paced environment and interacting with all kinds of people. I learned a lot about customer service, handling money, and staying calm under pressure.\nAs for volunteering, my favorite experience was being part of the organizing committee for an Islamic lecture session. It was fulfilling to help arrange everything and make sure the event went smoothly, and it was rewarding to see people benefit from the knowledge shared.",
  "work.life.4.question": "What was your least favorite job/volunteer experience?",
  "work.life.4.answer": "My least favorite job experience was probably when I worked as a street promoter. It was tough, standing on the street trying to get people’s attention and hand out flyers. There was a lot of rejection, and it felt like a lot of pressure.\nAs for volunteering, my least favorite experience was when I was part of the event committee in high school. I was assigned to the equipment and decoration section, which turned out to be the most tiring and least fun part for me. It was stressful dealing with all the logistics, and I didn’t enjoy it as much as I hoped.",
  "work.life.5.question": "Who was your favorite supervisor/boss?",
  "work.life.5.answer": "My favorite boss was the one I had when I first started working as a software engineer. He was super chill and encouraged creativity while still providing guidance when needed. What I liked most about him was that he trusted his team to make decisions and wasn’t micromanaging. He gave us the freedom to work on our own but always had our backs when we needed support. He really made work feel like a place where we could grow together.",
  "work.life.6.question": "Who was your least favorite supervisor/boss?",
  "work.life.6.answer": "My least favorite boss was the one I had during a short stint at a previous job. They were very controlling and didn’t trust the team to handle tasks on their own. There was a lot of micromanaging, and it made the work environment feel tense and frustrating. It was hard to get anything done because I always felt like someone was watching over my shoulder.",
  "work.life.7.question": "Are you working in your chosen field?",
  "work.life.7.answer": "Yes, I am working in my chosen field as a software engineer. It’s definitely the area I’ve always wanted to be in, and I enjoy the challenges it brings, along with the constant learning. It’s rewarding to see the things I work on come to life in products people use.",
  "work.life.8.question": "How many hours a week do you work?",
  "work.life.8.answer": "I work about 40-45 hours a week. It can vary depending on the workload or any tight deadlines we might have, but I try to maintain a balance so I don’t burn out.",
  "work.life.9.question": "How many hours a week will you work in your desired field?",
  "work.life.9.answer": "Ideally, I’d want to work around 20-25 hours a week in my desired field. That way, I’d have plenty of time to enjoy life, work on personal projects, and still make a decent income without feeling burnt out.",
  "work.life.10.question": "What does your job entail? (For example, do you often travel for business, work at home,  performs dangerous tasks?)",
  "work.life.10.answer": "As a software engineer, my job mainly involves writing and testing code, working on developing new features, and collaborating with other team members on projects. I don’t usually travel for business, and most of my work is done remotely or in the office, depending on the setup. It’s not dangerous, but it can get stressful during tight deadlines or when tackling complex problems.",
  "work.life.11.question": "What is your dream job?",
  "work.life.11.answer": "My dream job would be a role where I can combine my skills in software engineering with creative problem-solving. Ideally, I'd like to work in a company that encourages innovation and offers a flexible work environment. I’d love to be part of a team that builds impactful products, but also have the freedom to explore new ideas and take on projects that excite me.",
  "work.life.12.question": "Have you ever been called a workaholic?",
  "work.life.12.answer": "Yeah, I’ve been called a workaholic a few times, especially when I get really into a project. I tend to focus a lot and lose track of time when I’m immersed in something. But I’m working on finding a balance so I’m not working non-stop all the time.",
  "work.life.13.question": "Would you consider yourself a perfectionist?",
  "work.life.13.answer": "I would say I have some perfectionist tendencies, especially when it comes to work. I like things to be done right and to the best of my ability, but I’m also learning to accept that not everything needs to be perfect all the time. Sometimes, good enough is good enough.",
  "work.life.14.question": "Have you ever been fired?",
  "work.life.14.answer": "No, I’ve never been fired. Even though there was a layoff wave at my company, I didn’t get affected. I’ve always tried to stay on top of my work and contribute value to the team. I think staying adaptable and showing your worth is key, especially in uncertain times.",
  "work.life.15.question": "Have you ever quit a job suddenly? Have you changed jobs a lot?",
  "work.life.15.answer": "I’ve quit a job suddenly before. It was at a new startup where the salary was way too low—like, under 1 million. I just couldn’t make ends meet with that, so I had to leave. But I don’t usually job hop. I prefer to stick with a place where I can grow and contribute over the long term.",
  "work.life.16.question": "Do you consider your work a career or just a job?",
  "work.life.16.answer": "I consider my work a career. It’s something I’m passionate about and that aligns with my long-term goals. I’m constantly learning and growing in my field, and I see it as more than just a job—it’s a path I’m committed to and that brings me satisfaction beyond just earning a paycheck.",
  "work.life.17.question": "What is your retirement plan? What do you plan to do when you stop working?",
  "work.life.17.answer": "My retirement plan is to save and invest wisely over the years, so I can have financial freedom when the time comes. I’d like to travel, maybe even start a small business or get involved in projects that I’m passionate about. I also want to spend time with family and contribute to causes I care about.",
  "work.life.18.question": "Are there any projects you are passionate about?",
  "work.life.18.answer": "Yes, I’m passionate about projects that involve using technology to solve real-world problems, especially in areas like education or sustainability. I’d love to work on a project that helps people learn more effectively or one that contributes to environmental causes. Anything that feels impactful and can make a positive difference in people's lives excites me.",
  "work.life.19.question": "Let’s draw a pie chart showing how we each spend our time.",
  "work.life.19.answer": "Work 40%, Hobbies & Personal Projects 20%, Family & Friends 20%, Rest & Relaxation 10%, Travel & Exploration 10%",
  "religion.1.question": "Growing up, how did you learn about Islam?",
  "religion.1.answer": "Growing up, I learned about Islam through my family, especially my parents, who taught me the basics like prayer, fasting, and daily values. I also attended Islamic school and joined religious gatherings, like Quran recitation and Islamic lectures, which deepened my understanding over time.",
  "religion.2.question": "What were some positives and negatives regarding how you were taught about Islam?",
  "religion.2.answer": "One positive is that my parents and teachers made Islam feel practical and relevant to everyday life, teaching me to live with kindness and humility. However, a negative was that some aspects were taught rigidly, without much room for questions or exploration, which made it harder to connect with certain parts of the teachings when I was younger.",
  "religion.3.question": "If you had negative experiences, what can we do now to learn about Islam in an encouraging and positive environment?",
  "religion.3.answer": "If there were negative experiences, I think the key now is to create an environment where learning about Islam feels open, encouraging, and non-judgmental. We can have discussions where questions are welcomed, learn together through interactive and practical approaches, and surround ourselves with a supportive community that promotes understanding and growth.",
  "religion.4.question": "What role does Islam play in your life now?",
  "religion.4.answer": "Islam plays a central role in my life now. It’s my guide for making decisions, treating others with kindness, and staying grounded. It also gives me purpose, reminding me to strive for both personal growth and contributing to the community.",
  "religion.5.question": "How is your relationship with Allah?",
  "religion.5.answer": "My relationship with Allah is a work in progress. I try my best to stay consistent in prayer, seek guidance in difficult times, and reflect on His blessings. There are ups and downs, but I strive to strengthen it every day by staying grateful and trying to improve myself.",
  "religion.6.question": "What are ways you could improve your relationship with Allah?",
  "religion.6.answer": "I could improve my relationship with Allah by being more consistent in my prayers, dedicating more time to reading and understanding the Quran, and reflecting more deeply on His blessings and guidance. Another way is by actively seeking forgiveness and being mindful of my actions in everyday life.",
  "religion.7.question": "What is your opinion of Allah?",
  "religion.7.answer": "My opinion of Allah is that He is the most merciful, loving, and understanding. He always gives countless chances to improve and turn back to Him. Allah's wisdom is beyond human comprehension, and I feel that trusting Him is the best way to find peace and purpose in life.",
  "religion.8.question": "Do you believe Allah is a loving God?",
  "religion.8.answer": "Yes, I believe Allah is the most loving. His mercy and compassion are limitless, and He always gives us opportunities to seek forgiveness and improve ourselves. Even in difficult times, I feel His love through the lessons and strength He provides.",
  "religion.9.question": "What reminds you of the mercy of Allah?",
  "religion.9.answer": "The mercy of Allah is often reminded to me through the countless blessings in my life—like health, family, and opportunities I don't deserve but still receive. Even when I make mistakes, the chance to repent and try again is a constant reminder of His mercy.",
  "religion.10.question": "What is a moment in your life where your faith was strengthened in Allah?",
  "religion.10.answer": "A moment when my faith in Allah was strengthened was when I was going through a particularly challenging time at work, where there were layoff waves hitting the company, but I didn’t get affected. I saw so many of my colleagues lose their jobs, and I was worried, but I kept trusting that whatever happened, Allah had a plan for me.\nI stayed patient, kept praying, and did my best at work. Eventually, I realized that being spared from the layoff was a blessing and a reminder of Allah's mercy and protection.",
  "religion.11.question": "What is a moment that tested you in your faith?",
  "religion.11.answer": "A moment that really tested my faith was when I lost my father. It was a huge blow to me because he was not only a parent but also a role model and someone I always turned to for guidance. During that time, I struggled deeply with grief, questioning why such a loss had to happen.\nI felt a sense of unfairness and sadness that was hard to overcome. But through constant prayer and reflecting on Allah’s wisdom, I reminded myself that everything happens for a reason, and sometimes the test of faith comes through loss. That experience ultimately helped me grow stronger in my faith, as I leaned on Allah for strength and found peace in knowing that my father is in a better place.",
  "religion.12.question": "What is a lesson you have learned from the Prophet Muhammad?",
  "religion.12.answer": "One important lesson I’ve learned from the Prophet Muhammad is the value of patience and perseverance in the face of adversity.\nDespite facing countless trials and hardships throughout his life, he remained steadfast in his faith, always responding to challenges with kindness, wisdom, and unwavering trust in Allah. This has taught me to handle difficulties with a calm and positive mindset, to never lose hope, and to always strive to improve myself, no matter how hard the circumstances may be.",
  "religion.13.question": "The Prophet Muhammad is described by Allah as a mercy to all of creation, how can you incorporate more mercy into your life?",
  "religion.13.answer": "To incorporate more mercy into my life, I can start by being more compassionate and understanding toward others, whether it's family, friends, or even strangers. Being patient with people's flaws and mistakes, showing kindness through small actions, and offering forgiveness when it's needed are all ways to embody mercy.\nI can also strive to be more mindful in my prayers, asking Allah for the ability to show mercy in every situation, just as the Prophet Muhammad did.",
  "religion.14.question": "What is your biggest struggle when it comes to Islam?",
  "religion.14.answer": "My biggest struggle when it comes to Islam is consistently maintaining focus and sincerity in my worship, especially during busy times. Sometimes, I get caught up in the distractions of daily life, and it can be hard to keep up with my prayers and stay truly present in them.\nI recognize the importance of being mindful and humble during worship, and I'm always working on improving my connection with Allah, making time for reflection, and ensuring that I approach my faith with sincerity and devotion.",
  "religion.15.question": "How often do you pray (salah)?",
  "religion.15.answer": "I pray five times a day, and I’ve made it a habit to pray in congregation at the mosque whenever I can. It helps me feel more connected to the community and makes my prayers more meaningful. Even on days when I’m really busy, I try to make the time to go to the mosque, because I know how important it is to pray together with others.\nBeing in a mosque also brings me peace and focus, and I feel like it strengthens my faith.",
  "religion.16.question": "Is it common for you to delay or miss prayer?",
  "religion.16.answer": " I’ve never missed a prayer, the worst I do is delay it sometimes, but I always make sure to catch up as soon as I can. I understand the importance of prayer and try to keep up with it no matter how busy things get.\nIf I ever delay it, it’s usually just because of timing or unexpected events, but I always strive to pray on time and in congregation whenever possible.",
  "religion.17.question": "If you are out and won’t be home until prayer time ends, what are you likely to do?",
  "religion.17.answer": "If I’m out and won’t be home until the prayer time ends, I usually try to find a mosque or a quiet place to pray. If that’s not possible, I’ll make sure to pray as soon as I get home, even if I have to delay it a little bit.\nI always try to prioritize my prayers, no matter where I am, and I’ll do my best to find a way to perform them properly.",
  "religion.18.question": "What would you like to improve about your prayer?",
  "religion.18.answer": " I’d like to improve the focus and sincerity in my prayers. Sometimes my mind wanders during salah, and I want to work on being more present in my worship, reflecting deeply on the meanings of the words and actions. I also aim to pray with more humility and connection to Allah, asking for His guidance in a more heartfelt way.",
  "religion.19.question": "How often do you make dua (pray to Allah and ask Him for your needs)?",
  "religion.19.answer": "I make dua regularly, especially during moments of reflection, after my prayers, or when I’m going through a tough time. I believe that dua is a way to strengthen my connection with Allah and seek His help.\nI try to be consistent with it, asking for guidance, forgiveness, and anything else I need in my life. It’s also a time for me to express gratitude for the blessings I already have.",
  "religion.20.question": "How often do you read the Quran?",
  "religion.20.answer": "I try to read the Quran every day, even if it’s just a small portion. I believe that reading the Quran regularly helps me stay connected to Allah and reminds me of His guidance.\nOn days when I’m busy, I try to make time in the evening or during breaks to read a few verses. It’s something I try to keep consistent, and I hope to improve my understanding of it over time.",
  "religion.21.question": "Do you ever read a translation of the Quran?",
  "religion.21.answer": "I’ve only read the translation of the Quran once, and that was a long time ago when I was still in college. Since then, I’ve been more focused on attending tafsir sessions to deepen my understanding. I find it more beneficial to learn from scholars and discussions around the verses rather than just relying on translations.",
  "religion.22.question": "How do you improve your knowledge of Islam?",
  "religion.22.answer": "I improve my knowledge of Islam by attending religious lectures, reading books, and following online resources from scholars I trust.\nI also actively participate in study groups to discuss Islamic teachings and ask questions when I need clarification. The more I learn, the more I feel inspired to apply those teachings in my daily life.",
  "religion.23.question": "How often do you go to the masjid? How often would you like to go?",
  "religion.23.answer": "I’m already pretty consistent with going to the masjid for jamaah prayers, especially for the five daily prayers. I also regularly attend Islamic study sessions or lectures that are held at the masjid.\nIt’s become part of my routine, and I feel it strengthens my connection to Allah and helps me stay focused on my faith.",
  "religion.24.question": "Who are the greatest positive Islamic influences in your life?",
  "religion.24.answer": "The greatest positive Islamic influences in my life are my parents, especially my mother, who has always taught me the values of patience, gratitude, and devotion. I also look up to some of the scholars and teachers I’ve learned from in various Islamic study sessions.\nTheir wisdom, knowledge, and ability to live by the teachings of Islam inspire me to keep striving to be a better person.",
  "communication.1.question": "Knowing that couples who attend premarital counseling/training are 30% less likely to get divorced, would you want to go through a premarital counseling course?",
  "communication.1.answer": "Yes, I would definitely consider going through a premarital counseling course. I think it’s important to go into marriage with a solid understanding of each other’s values, expectations, and how to handle challenges together.\nIt’s reassuring to know that couples who go through counseling have a better chance at building a lasting relationship. I’d want to equip myself with the tools to create a healthy and strong marriage.",
  "communication.2.question": "Would you be willing to go to marriage counseling if we were having marital problems?",
  "communication.2.answer": "Yes, I would be willing to go to marriage counseling if we were having marital problems. I believe that seeking help when things get tough shows a commitment to making the relationship work.\nIt’s important to communicate and address issues before they escalate, and a professional counselor can help guide us through it and strengthen our relationship.",
  "communication.3.question": "If we have a disagreement that we cannot overcome, who would you want us to go to for counseling?",
  "communication.3.answer": "If we had a disagreement that we couldn’t overcome, I’d want us to go to a professional marriage counselor or a trusted Islamic scholar who specializes in marital issues.\nIt’s important to have someone who understands both the emotional and spiritual aspects of a relationship and can provide guidance that aligns with our values and faith.",
  "communication.4.question": "What do you find easier to convey: your thoughts or feelings?",
  "communication.4.answer": "I find it easier to convey my thoughts. I’m usually able to express ideas and opinions clearly, especially when it comes to topics I’m passionate about.\nHowever, expressing my feelings can be a bit more challenging, especially if I’m feeling vulnerable or unsure about how to communicate them.",
  "communication.5.question": "When you need to apologize, do you rush to apologize or do you give the person time and space before apologizing?",
  "communication.5.answer": "I usually give the person some time and space before apologizing. I think it’s important to let emotions settle down first, so the apology is more sincere and effective.\nI don’t want it to feel rushed or forced, but I always make sure to apologize once I’ve had time to reflect on what happened.",
  "communication.6.question": "How do you handle disagreements?",
  "communication.6.answer": "I try to stay calm and listen to the other person’s perspective. I think it’s important to understand where they’re coming from and to have a respectful conversation about our differences.\nIf we can’t agree right away, I’m okay with taking some time to think things through before revisiting the issue and finding a solution together.",
  "communication.7.question": "Would you rather stay silent about an issue in fear that a larger problem/argument may arise?",
  "communication.7.answer": "I might choose to stay silent, especially if I feel like the timing isn’t right or if it’s a minor issue.\nBut deep down, I know it’s better to bring it up so that it doesn’t turn into something bigger later on. I think addressing it early is key to preventing bigger problems.",
  "communication.8.question": "Do you emotionally rush into conversations in hopes of trying to resolve a situation?",
  "communication.8.answer": "Sometimes I do feel like rushing into conversations, especially when I’m emotionally charged and want to fix things quickly. But I’ve learned that it’s better to take a step back and approach the situation calmly.\nRushing can make things worse, and it's more effective to approach the conversation with a clear mind.",
  "communication.9.question": "Would you rather discuss issues as they arise or wait until you have a few problems?",
  "communication.9.answer": "If the issue is small, I’d usually wait until it starts becoming more bothersome. I don’t like to make a big deal out of small things, but once it starts affecting me or the situation, I’ll bring it up to discuss it and solve it.",
  "communication.10.question": "When a problem arises, do you want to fix the situation immediately or do you want time and space?",
  "communication.10.answer": "It depends on the situation. If it's something small, I prefer to fix it right away. But if it's something bigger or more complicated, I might need some time and space to think it through before addressing it properly.",
  "communication.11.question": "Have you ever had to help two parties reconcile?",
  "communication.11.answer": "No, I haven’t had to do that yet.",
  "communication.12.question": "If there is a disagreement between me and your family, how would you handle the situation?",
  "communication.12.answer": "By default, I’d defend my partner. I think if I don’t defend them, where else would they go for support? But of course, I’d still try to handle the situation respectfully and make sure everyone understands each other.",
  "communication.13.question": "How would you communicate if you are dissatisfied emotionally and/or physically?",
  "communication.13.answer": "If I’m emotionally or physically dissatisfied, I usually prefer to be alone for a bit to calm my thoughts down. After that, I’d communicate how I’m feeling and explain why, but I try to do it in a way that doesn’t put blame on anyone. I think it’s important to give myself space first, then address it calmly.",
  "communication.14.question": "What is the best way to handle disagreements in a marriage?",
  "communication.14.answer": "The best way to handle disagreements in a marriage is to stay calm and listen to each other. I think it’s important to understand each other’s perspectives and not jump to conclusions.\nAddress the issue, not each other’s character. Stay respectful and try to compromise without letting things escalate.",
  "communication.15.question": "How can I be better at communicating with you?",
  "communication.15.answer": "To be better at communicating with me, I think it’s important to be open, honest, and patient. Sometimes I might need time to process things before I speak, so it helps when you’re understanding of that.\nAlso, I’d prefer if we don’t talk about sensitive topics, especially ones that could lead to conflict, when I’m upset. I really appreciate it when we can talk calmly and respectfully, even when we disagree."
}
